ИС_СПОРТ_2022/src/Catalogs/СпортивныеОбъекты/СпортивныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпортивныеОбъекты</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/СпортивныеОбъекты/ObjectModule.bsl
//{Рарус ivaart IN-21637 Географические объекты. Проверка координат на исключительность 2021.10.22
Процедура ПередЗаписью(Отказ)
	Удачно = ПроверкаКоординат();
	Пока Не Удачно Цикл 
		Удачно = ПроверкаКоординат();
	КонецЦикла;
КонецПроцедуры

Функция ПроверкаКоординат()
	Запрос = Новый Запрос;
	Запрос.Текст =
		// {Рарус dotere #21983 -Добавил для удаления ошбки прав 2021.11.03
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		// }Рарус dotere #21983 -Добавил для удаления ошбки прав 2021.11.03
		|	СпортивныеОбъекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СпортивныеОбъекты КАК СпортивныеОбъекты
		|ГДЕ
		|	СпортивныеОбъекты.Широта = &Широта
		|	И СпортивныеОбъекты.Долгота = &Долгота
		|	И СпортивныеОбъекты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Долгота", Долгота);
	Запрос.УстановитьПараметр("Широта", Широта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() И Не(Широта = 0 И Долгота = 0) тогда 
		Генератор = новый ГенераторСлучайныхЧисел();
		
		Направление = Генератор.СлучайноеЧисло(0,2);
		ПогрешностьДолгота = (Генератор.СлучайноеЧисло(325,450)/10000000)*?(направление > 1, -1, 1);
		
		Направление = Генератор.СлучайноеЧисло(0,2);
		ПогрешностьШирота =  (Генератор.СлучайноеЧисло(325,450)/10000000)*?(направление > 1, -1, 1);
		
		Широта = Широта + ПогрешностьШирота;
		Долгота = Долгота + ПогрешностьДолгота;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
//}Рарус ivaart IN-21637 Географические объекты. Проверка координат на исключительность 2021.10.22
